Enums/Перевозчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>Перевозчики</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>DHL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EtihadAirlines</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EmiratesSkyCargo</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Fedex</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>KoreanAirlines</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>QantasAirlines</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SingaporeAirlines</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TurkishAirlines</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UPS</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Перевозчики/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
		
	ДанныеВыбора = Новый СписокЗначений;     
	ДанныеВыбора.Добавить(Перечисления.Перевозчики.DHL, Перечисления.Перевозчики.DHL, , БиблиотекаКартинок.DHL);
	ДанныеВыбора.Добавить(Перечисления.Перевозчики.EtihadAirlines, Перечисления.Перевозчики.EtihadAirlines, , );
	ДанныеВыбора.Добавить(Перечисления.Перевозчики.EmiratesSkyCargo, Перечисления.Перевозчики.EmiratesSkyCargo, , БиблиотекаКартинок.Emirates);
	ДанныеВыбора.Добавить(Перечисления.Перевозчики.Fedex, Перечисления.Перевозчики.Fedex, , БиблиотекаКартинок.Fedex);
	ДанныеВыбора.Добавить(Перечисления.Перевозчики.KoreanAirlines, Перечисления.Перевозчики.KoreanAirlines, , БиблиотекаКартинок.korean_logo);
	ДанныеВыбора.Добавить(Перечисления.Перевозчики.QantasAirlines, Перечисления.Перевозчики.QantasAirlines, , БиблиотекаКартинок.quantas_logo);
	ДанныеВыбора.Добавить(Перечисления.Перевозчики.SingaporeAirlines, Перечисления.Перевозчики.SingaporeAirlines, , БиблиотекаКартинок.singapore_logo);
	ДанныеВыбора.Добавить(Перечисления.Перевозчики.TurkishAirlines, Перечисления.Перевозчики.TurkishAirlines, , БиблиотекаКартинок.turk_logo);
	ДанныеВыбора.Добавить(Перечисления.Перевозчики.UPS, Перечисления.Перевозчики.UPS, , БиблиотекаКартинок.upc_logo);
	
КонецПроцедуры
